espressif/esp-idf/components/soc/esp32c5/include/soc/lp_i2c_struct.h
/** Type of comd5 register
 *  I2C command register 5
 */
typedef union {
    struct {
        /** command5 : R/W; bitpos: [13:0]; default: 0;
         *  Configures command 5. See details in I2C_CMD0_REG[13:0].
         */
        uint32_t command5:14;
        uint32_t reserved_14:17;
        /** command5_done : R/W/SS; bitpos: [31]; default: 0;
         *  Represents whether command 5 is done in I2C Master mode.
         *  0: Not done
         *
         *  1: Done
         */
        uint32_t command5_done:1;
    };
    uint32_t val;
} lp_i2c_comd5_reg_t;

/** Type of comd6 register
 *  I2C command register 6
 */
typedef union {
    struct {
        /** command6 : R/W; bitpos: [13:0]; default: 0;
         *  Configures command 6. See details in I2C_CMD0_REG[13:0].
         */
        uint32_t command6:14;
        uint32_t reserved_14:17;
        /** command6_done : R/W/SS; bitpos: [31]; default: 0;
         *  Represents whether command 6 is done in I2C Master mode.
         *  0: Not done
         *
         *  1: Done
         */
        uint32_t command6_done:1;
    };
    uint32_t val;
} lp_i2c_comd6_reg_t;

/** Type of comd7 register
 *  I2C command register 7
 */
typedef union {
    struct {
        /** command7 : R/W; bitpos: [13:0]; default: 0;
         *  Configures command 7. See details in I2C_CMD0_REG[13:0].
         */
        uint32_t command7:14;
        uint32_t reserved_14:17;
        /** command7_done : R/W/SS; bitpos: [31]; default: 0;
         *  Represents whether command 7 is done in I2C Master mode.
         *  0: Not done
         *
         *  1: Done
         */
        uint32_t command7_done:1;
    };
    uint32_t val;
} lp_i2c_comd7_reg_t;


/** Group: Version register */
/** Type of date register
 *  Version register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 35656003;
         *  Version control register.
         */
        uint32_t date:32;
    };
    uint32_t val;
} lp_i2c_date_reg_t;


/** Group: Address register */
/** Type of txfifo_start_addr register
 *  I2C TXFIFO base address register
 */
typedef union {
    struct {
        /** txfifo_start_addr : HRO; bitpos: [31:0]; default: 0;
         *  Represents the I2C txfifo first address.
         */
        uint32_t txfifo_start_addr:32;
    };
    uint32_t val;
} lp_i2c_txfifo_start_addr_reg_t;

/** Type of rxfifo_start_addr register
 *  I2C RXFIFO base address register
 */
typedef union {
    struct {
        /** rxfifo_start_addr : HRO; bitpos: [31:0]; default: 0;
         *  Represents the I2C rxfifo first address.
         */
        uint32_t rxfifo_start_addr:32;
    };
    uint32_t val;
} lp_i2c_rxfifo_start_addr_reg_t;


typedef struct {
    volatile lp_i2c_scl_low_period_reg_t scl_low_period;
    volatile lp_i2c_ctr_reg_t ctr;
    volatile lp_i2c_sr_reg_t sr;
    volatile lp_i2c_to_reg_t to;
    uint32_t reserved_010;
    volatile lp_i2c_fifo_st_reg_t fifo_st;
    volatile lp_i2c_fifo_conf_reg_t fifo_conf;
    volatile lp_i2c_data_reg_t data;
    volatile lp_i2c_int_raw_reg_t int_raw;
    volatile lp_i2c_int_clr_reg_t int_clr;
    volatile lp_i2c_int_ena_reg_t int_ena;
    volatile lp_i2c_int_status_reg_t int_status;
    volatile lp_i2c_sda_hold_reg_t sda_hold;
    volatile lp_i2c_sda_sample_reg_t sda_sample;
    volatile lp_i2c_scl_high_period_reg_t scl_high_period;
    uint32_t reserved_03c;
    volatile lp_i2c_scl_start_hold_reg_t scl_start_hold;
    volatile lp_i2c_scl_rstart_setup_reg_t scl_rstart_setup;
    volatile lp_i2c_scl_stop_hold_reg_t scl_stop_hold;
    volatile lp_i2c_scl_stop_setup_reg_t scl_stop_setup;
    volatile lp_i2c_filter_cfg_reg_t filter_cfg;
    volatile lp_i2c_clk_conf_reg_t clk_conf;
    volatile lp_i2c_comd0_reg_t comd0;
    volatile lp_i2c_comd1_reg_t comd1;
    volatile lp_i2c_comd2_reg_t comd2;
    volatile lp_i2c_comd3_reg_t comd3;
    volatile lp_i2c_comd4_reg_t comd4;
    volatile lp_i2c_comd5_reg_t comd5;
    volatile lp_i2c_comd6_reg_t comd6;
    volatile lp_i2c_comd7_reg_t comd7;
    volatile lp_i2c_scl_st_time_out_reg_t scl_st_time_out;
    volatile lp_i2c_scl_main_st_time_out_reg_t scl_main_st_time_out;
    volatile lp_i2c_scl_sp_conf_reg_t scl_sp_conf;
    uint32_t reserved_084[29];
    volatile lp_i2c_date_reg_t date;
    uint32_t reserved_0fc;
    volatile lp_i2c_txfifo_start_addr_reg_t txfifo_start_addr;
    uint32_t reserved_104[31];
    volatile lp_i2c_rxfifo_start_addr_reg_t rxfifo_start_addr;
} lp_i2c_dev_t;

extern lp_i2c_dev_t LP_I2C;

#ifndef __cplusplus
_Static_assert(sizeof(lp_i2c_dev_t) == 0x184, "Invalid size of lp_i2c_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
